# Pandas Select Columns by Name

For detailed explanation of this examples refer to [pandas loc[]](https://sparkbyexamples.com/pandas/pandas-loc-usage-with-examples)

In [1]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days'],
    'Discount':[1000,2300]
              }
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  20000   30days      1000
1  PySpark  25000   40days      2300

In [2]:
#Select DataFrame Columns by Name
# Select Columns by labels
df2 = df[["Courses","Fee","Duration"]]
df2

   Courses    Fee Duration
0    Spark  20000   30days
1  PySpark  25000   40days

In [3]:
# Select Multiple Columns
df2 = df.loc[:, ["Courses","Fee","Discount"]]
df2

   Courses    Fee  Discount
0    Spark  20000      1000
1  PySpark  25000      2300

In [4]:
# Select all columns between Fee an Discount columns
df2 = df.loc[:,'Fee':'Discount']
df2

     Fee Duration  Discount
0  20000   30days      1000
1  25000   40days      2300

In [5]:
# Select from 'Duration' column
df2 = df.loc[:,'Duration':]
df2

  Duration  Discount
0   30days      1000
1   40days      2300

In [6]:
# Select from beginning and end at 'Duration' column
df2 = df.loc[:,:'Duration']
df2

   Courses    Fee Duration
0    Spark  20000   30days
1  PySpark  25000   40days

In [7]:
# Select every alternate column
df2 = df.loc[:,::2]
df2

   Courses Duration
0    Spark   30days
1  PySpark   40days